{
  "backend/main.mo": "Motoko backend defining types, access control mixin, rating and comment data structures, and alias generation for authenticated principals.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, associated files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend source files describing structure, behavior, and UI patterns.",
  "frontend/DEPLOYMENT-PRODUCTION.md": "Guide detailing prerequisites and steps for deploying the frontend and backend to production on the Internet Computer.",
  "frontend/index.css": "Tailwind base variables and theming definitions with light/dark mode color tokens and global element styling.",
  "frontend/index.html": "Defines the root HTML document with SEO meta tags and loads the React app entry point.",
  "frontend/public/robots.txt": "Configures crawler access, allowing all bots and specifying sitemap location and crawl delay.",
  "frontend/public/sitemap.xml": "Lists key site routes with metadata for search engines including change frequency and priority.",
  "frontend/QA-PRELAUNCH-CHECKLIST.md": "Comprehensive QA checklist covering routing, responsiveness, accessibility, motion preferences, and UI behavior before launch.",
  "frontend/src/App.tsx": "Sets up the application's route structure using TanStack Router and loads all top-level and capability-specific pages.",
  "frontend/src/components/AboutVisionSection.tsx": "Renders a marketing section comparing traditional AI to Forge with styled feature lists and messaging.",
  "frontend/src/components/ActivityFeed.tsx": "Displays a timed, animated activity feed with accessibility support, applying variant messages and calling onComplete when done.",
  "frontend/src/components/AgentCard.tsx": "Shows a UI card summarizing an agent’s identity, capabilities, rating, and task acceptance.",
  "frontend/src/components/AgentSelfOnboardingContract.tsx": "Provides a UI card layout describing the agent self-onboarding contract and showing a JSON capability schema.",
  "frontend/src/components/AiToHumanComingSoonSection.tsx": "Marketing section describing future agent-to-human task routing with narrative and value framing blocks.",
  "frontend/src/components/AuthStatus.tsx": "Authentication UI showing sign-in/out controls and triggering profile setup when needed.",
  "frontend/src/components/CommentsFeedback.tsx": "Commenting widget that lists comments, allows posting new ones, and supports upvoting with identity checks.",
  "frontend/src/components/CtaBackButton.tsx": "Simple back button that navigates browser history backward.",
  "frontend/src/components/DevelopersSection.tsx": "Developer-focused marketing section explaining how to deploy agents and outlining workflow steps.",
  "frontend/src/components/ExecutionPanel.tsx": "Interactive execution flow panel simulating agent analysis, selection, and result display using staged phases.",
  "frontend/src/components/FooterNote.tsx": "Footer component with multi-column navigation links and branding icons.",
  "frontend/src/components/ForgeBrandMark.tsx": "Renders the Forge AI text logo with size-based typography and optional custom classes.",
  "frontend/src/components/ForgeQuoteCard.tsx": "Displays an animated inspirational quote card with decorative quote icons and a closing statement.",
  "frontend/src/components/FullScreenNavOverlay.tsx": "Provides a full-screen navigation menu with focus trapping, ESC handling, and body scroll lock.",
  "frontend/src/components/GlobalHeader.tsx": "Implements the global header with scroll-based styling and a hamburger-triggered full-screen menu.",
  "frontend/src/components/HeroSection.tsx": "Hero section with brand mark, headline, task input, and navigation CTAs using identity and last-task data.",
  "frontend/src/components/home/HomeHeroValueStack.tsx": "Layout component for homepage hero sections, organizing headline, supporting text, and actions.",
  "frontend/src/components/home/LiveMarketplacePreview.tsx": "Shows placeholder marketplace items in a grid with ratings, pricing, categories, and execution counts.",
  "frontend/src/components/home/MarketplaceOutcomeFlow.tsx": "Displays a three‑step marketplace workflow: request, orchestrate, and deliver.",
  "frontend/src/components/HomeSectionIndexFooter.tsx": "Sticky footer offering quick-scroll buttons to major homepage sections.",
  "frontend/src/components/ImpactStatement.tsx": "Reusable styled text component for emphasized impact statements with size variants.",
  "frontend/src/components/JumpToFooter.tsx": "Floating button that scrolls smoothly to a referenced footer element, respecting motion preferences.",
  "frontend/src/components/MagicalOnboardingSurvey.tsx": "Guided onboarding section presenting template prompts that navigate to the demo lab.",
  "frontend/src/components/MarketingSectionHeader.tsx": "Reusable marketing header component with title, subtitle, optional micro-statement, and children content.",
  "frontend/src/components/MarketplaceDiscoverySection.tsx": "UI for browsing templates and entering free‑form prompts, with mode toggle and navigation to a demo using selected or typed prompts.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for capturing and saving a user’s name, handling profile creation via mutation with success and error toasts.",
  "frontend/src/components/ProgressiveDisclosure.tsx": "Reusable collapsible section that reveals children content with animated open/close behavior.",
  "frontend/src/components/RatingStars.tsx": "Five‑star rating widget that loads existing ratings, requires auth, and submits updates with visual feedback.",
  "frontend/src/components/ResultReveal.tsx": "Animated reveal component for job results, showing metadata, deliverables, and a rating section after a timed delay.",
  "frontend/src/components/RoadmapTimeline.tsx": "Interactive multi‑year roadmap selector displaying milestones and descriptions with animated timeline UI.",
  "frontend/src/components/RotatingPlaceholderInput.tsx": "Input field with rotating placeholder text unless reduced‑motion is preferred, submitting on Enter key.",
  "frontend/src/components/TrustComplianceStrip.tsx": "Renders a four‑item trust and compliance feature strip with icons and descriptions.",
  "frontend/src/components/TrustedMetricsBar.tsx": "Displays live platform metrics using cards with icons, values, and labels.",
  "frontend/src/content/exploreDemoLabCopy.ts": "Centralized copy definitions for Explore and Demo Lab flows with text used across UI steps.",
  "frontend/src/content/lexicon.ts": "Defines shared terminology, preferred verbs, and reusable micro‑statements for consistent copy.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing when identity changes.",
  "frontend/src/hooks/useAgentFirstMode.ts": "Hook for toggling and persisting agent-first mode using session storage.",
  "frontend/src/hooks/useAuthGuard.ts": "Provides an authentication guard that triggers login when required.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching, adding, and upvoting comments via the backend actor with auth checks.",
  "frontend/src/hooks/useCtaNavigation.ts": "Navigation helper marking transitions as CTA-driven for UI behavior.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates document titles based on current route using predefined mappings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, identity persistence, and login status management using Dfinity AuthClient.",
  "frontend/src/hooks/usePlatformPerformanceMetrics.ts": "Generates time-based simulated platform metrics that update every 30 seconds without backend requests.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates when the system preference changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating user profiles, ratings, and last forged tasks.",
  "frontend/src/hooks/useRouteMeta.ts": "Maps routes to meta descriptions and Open Graph titles and updates metadata on route changes.",
  "frontend/src/hooks/useScrollBehavior.ts": "Provides smooth scroll-to-top and scroll-to-element helpers that respect reduced-motion preferences.",
  "frontend/src/hooks/useScrollRestoration.ts": "Restores scroll positions on browser back/forward navigation by tracking positions per route.",
  "frontend/src/hooks/useSectionEntryMotion.ts": "Triggers section entry animations based on IntersectionObserver visibility, with reduced-motion and fallback handling.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, motion tokens, typography, and base styling for light and dark modes.",
  "frontend/src/layouts/RootLayout.tsx": "Provides the app’s root layout with global header/footer, background effects, scroll handling, and conditional CTA back button.",
  "frontend/src/lib/demo/canonicalWatcherDemo.ts": "Legacy wrapper that selects a template type and delegates demo generation to the template engine.",
  "frontend/src/lib/demo/executionTemplates.ts": "Generates structured demo outputs and activity feeds for research, ops, support, and watcher workflows using template-specific logic.",
  "frontend/src/lib/demo/promptTemplates.ts": "Defines prompt templates that map user tasks to template types for research, ops, support, and watcher workflows.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers and loading global styles.",
  "frontend/src/motion/sectionEntryProfiles.ts": "Defines motion profiles specifying timing, easing, and intensity for different section-entry reveal animations.",
  "frontend/src/motion/SectionEntryReveal.tsx": "Reusable animation wrapper that triggers section-entry reveal effects based on motion profiles and intersection visibility.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page explaining Forge AI’s purpose, workflow, and why it runs on the Internet Computer. Contains multiple informational sections with headings, text, and feature lists.",
  "frontend/src/pages/AgentSelfOnboardingPage.tsx": "Displays the self-onboarding protocol for agents, including capability schemas, funding rules, execution guarantees, and ICP-specific benefits. Uses styled sections and icons to present the full specification.",
  "frontend/src/pages/BuildPage.tsx": "Provides an overview for developers on building autonomous agents, highlighting benefits and offering a guided getting-started section. Includes feature blocks and navigation hooks.",
  "frontend/src/pages/DemoLabPage.tsx": "Implements the interactive Demo Lab where users submit prompts, run agent tasks, and view execution output. Manages template selection, job creation, authentication, and UI state transitions.",
  "frontend/src/pages/DevelopersPage.tsx": "Shows the Developers landing page with a headline, description, and embedded DevelopersSection component. Serves as an entry point for developer resources.",
  "frontend/src/pages/DocsPage.tsx": "Renders the documentation overview page introducing Forge concepts like autonomous execution, coordination, and on-chain settlement. Uses styled content blocks with icons and descriptions.",
  "frontend/src/pages/ExplorePage.tsx": "Interactive explore page letting users enter free‑form prompts or choose predefined samples, then navigating to the demo lab with the selected prompt.",
  "frontend/src/pages/ForgeHomePage.tsx": "Home page presenting the product’s hero section, value props, credibility signals, and navigation CTAs with animated section reveals.",
  "frontend/src/pages/LoginPage.tsx": "Login page explaining Internet Identity authentication and its benefits, displaying the AuthStatus component for sign‑in.",
  "frontend/src/pages/marketplace/CapabilityHiringSourcingAgentsPage.tsx": "Explains how agents hire other agents, listing key capabilities and example workflows.",
  "frontend/src/pages/marketplace/CapabilityHumanInTheLoopControlsPage.tsx": "Describes human approval controls for agent workflows, including capabilities and example use cases.",
  "frontend/src/pages/marketplace/CapabilityLongRunningWorkflowsPage.tsx": "Covers long-running agent workflows with persistent state, scheduling, and related example use cases.",
  "frontend/src/pages/marketplace/CapabilityMultiAgentCollaborationPage.tsx": "React page describing multi-agent collaboration with explanations, capabilities, and example use cases.",
  "frontend/src/pages/marketplace/CapabilityTaskDrivenAgentsPage.tsx": "React page outlining task-driven agents, their autonomous workflow abilities, and related use cases.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace overview page describing autonomous agent coordination and showing an example multi‑agent workflow with CTAs.",
  "frontend/src/pages/PlaybooksPage.tsx": "Playbooks page outlining job request formats with human guidance and machine‑readable specs, plus examples and structured output details.",
  "frontend/src/pages/RoadmapPage.tsx": "Roadmap page displaying the product timeline and a feedback section with comments and contact info.",
  "frontend/src/pages/SupportPage.tsx": "Renders the Support page with contact info, donation address copying, and explanations of ICP and ckBTC.",
  "frontend/src/pages/VisionPage.tsx": "Displays the platform vision with detailed descriptions of autonomous agent coordination and example workflows.",
  "frontend/src/utils/jobId.ts": "Utility for generating unique jobIds and validating their format.",
  "frontend/src/utils/rareVariants.ts": "Generates deterministic rare text variants based on jobId and includes predefined variant sets.",
  "frontend/src/utils/time.ts": "Provides UTC timestamp formatting utilities in short and long forms.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage support and hash handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, spacing, animations, and plugin setup.",
  "frontend/VERIFICATION-NOTES-PRODUCTION.md": "Production deployment verification checklist capturing routing, SEO, identity, and scroll behavior validation steps.",
  "project_state.json": "Metadata describing project state, redesign goals, architectural notes, and pending homepage refactor requirements."
}