{
  "backend/main.mo": "Motoko backend defining types, access-controlled alias generation, comment storage, and comparison modules for map keys.",
  "feature_evidence.json": "Feature evidence report listing vision-page rewrite requirements, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and recent updates of various frontend components and pages.",
  "frontend/DEPLOYMENT-PRODUCTION.md": "Guide detailing prerequisites and steps for deploying the Forge AI frontend and backend to IC mainnet.",
  "frontend/index.css": "Tailwind CSS base theme defining color variables, dark mode overrides, and global styling tokens for the UI.",
  "frontend/index.html": "HTML entry point setting metadata, SEO tags, and loading the React app via main.tsx.",
  "frontend/public/robots.txt": "Allows all crawlers, sets a sitemap path, and defines a small crawl delay.",
  "frontend/public/sitemap.xml": "XML sitemap listing main site routes with priorities and change frequencies.",
  "frontend/QA-PRELAUNCH-CHECKLIST.md": "Comprehensive QA checklist covering routing, responsiveness, accessibility, motion settings, CTAs, and SEO before launch.",
  "frontend/src/App.tsx": "Configures the TanStack router and maps all top‑level and marketplace sub‑routes to their React page components.",
  "frontend/src/components/AboutVisionSection.tsx": "UI section comparing traditional AI with Forge and highlighting key platform capabilities.",
  "frontend/src/components/ActivityFeed.tsx": "Animated activity feed component that reveals items over time, applies rare message variants, and triggers completion callbacks.",
  "frontend/src/components/AgentCard.tsx": "Visual card displaying basic agent details, reputation, and task acceptance status.",
  "frontend/src/components/AgentSelfOnboardingContract.tsx": "Renders human‑readable and machine‑parseable contract schemas for autonomous agent onboarding, including capability declarations.",
  "frontend/src/components/AiToHumanComingSoonSection.tsx": "Renders a coming‑soon marketing section describing future human-assisted agent workflows with narrative text blocks and styled panels.",
  "frontend/src/components/AuthStatus.tsx": "Handles authentication UI, showing sign-in/out buttons and a profile setup modal based on Internet Identity state.",
  "frontend/src/components/CommentsFeedback.tsx": "Provides a comments UI with form submission, listing, timestamps, and upvoting tied to page context and identity.",
  "frontend/src/components/CtaBackButton.tsx": "Simple back-navigation button that triggers browser history back.",
  "frontend/src/components/DevelopersSection.tsx": "Marketing and instructional section for deploying agents, including value propositions and a guarded deploy action.",
  "frontend/src/components/ExecutionPanel.tsx": "Controls a multi-phase execution UI, generating demo data, sequencing status messages, and showing agent activity and results.",
  "frontend/src/components/FooterNote.tsx": "Footer layout with four columns of navigational links and branding icons.",
  "frontend/src/components/ForgeBrandMark.tsx": "Renders the Forge text logo with size-based styling classes.",
  "frontend/src/components/ForgeQuoteCard.tsx": "Animated quote card that fades into view and displays a vision statement with decorative quote icons.",
  "frontend/src/components/FullScreenNavOverlay.tsx": "Full‑screen navigation menu with focus trapping, ESC handling, and scroll‑locking behavior.",
  "frontend/src/components/GlobalHeader.tsx": "Sticky site header with scroll‑based styling and a hamburger button that opens the full‑screen nav overlay.",
  "frontend/src/components/HeroSection.tsx": "Landing hero with branding, headline, and CTAs that navigate to workflows based on user input or last task.",
  "frontend/src/components/HomeSectionIndexFooter.tsx": "Sticky footer providing quick-jump buttons to major homepage sections using smooth scrolling.",
  "frontend/src/components/JumpToFooter.tsx": "Floating button that scrolls the viewport to a provided footer element, respecting motion preferences.",
  "frontend/src/components/MagicalOnboardingSurvey.tsx": "Survey section offering clickable workflow templates that navigate to a demo with preset prompts.",
  "frontend/src/components/MarketingSectionHeader.tsx": "Reusable marketing header component displaying a title, optional subtitle, micro‑statement, and children.",
  "frontend/src/components/MarketplaceDiscoverySection.tsx": "Marketplace discovery UI with agent/human mode toggle, free‑form workflow input, and template-based job selection.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves the profile via mutation with success and error toasts.",
  "frontend/src/components/ProgressiveDisclosure.tsx": "Collapsible UI component that toggles visibility of its children with animated open/close behavior.",
  "frontend/src/components/RatingStars.tsx": "Interactive star rating component that loads existing ratings, submits new ratings, and handles auth and mutation states.",
  "frontend/src/components/ResultReveal.tsx": "Animated display of a job result including title, description, optional deliverable, metadata, and rating section.",
  "frontend/src/components/RoadmapTimeline.tsx": "Interactive multi-year roadmap component letting users select timeline entries to view associated details.",
  "frontend/src/components/RotatingPlaceholderInput.tsx": "Input field that cycles through preset placeholder prompts unless reduced-motion is enabled and triggers submit on Enter.",
  "frontend/src/components/TrustComplianceStrip.tsx": "Static section highlighting trust and compliance features using icons and descriptive text.",
  "frontend/src/components/TrustedMetricsBar.tsx": "Displays live platform performance metrics in a grid of cards with icons and auto-updating values.",
  "frontend/src/content/exploreDemoLabCopy.ts": "Defines centralized UI copy for Explore and Demo Lab flows, including labels, headings, and CTA text.",
  "frontend/src/content/lexicon.ts": "Provides a shared terminology dictionary with preferred terms, definitions, and reusable micro-statements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useAgentFirstMode.ts": "Manages a session-stored boolean flag for toggling agent-first mode.",
  "frontend/src/hooks/useAuthGuard.ts": "Exposes a helper to require authentication via Internet Identity before protected actions.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching, adding, and upvoting comments, tied to actor availability and auth guard.",
  "frontend/src/hooks/useCtaNavigation.ts": "Provides a CTA-aware navigation helper that marks navigation state for UI back-button handling.",
  "frontend/src/hooks/useDocumentTitle.ts": "Maps routes to document titles and updates the page title on navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, stored identity loading, and identity state management.",
  "frontend/src/hooks/usePlatformPerformanceMetrics.ts": "Generates time-based simulated platform metrics that update periodically without backend calls.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the user's prefers-reduced-motion setting.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for user profiles, ratings, and last forged task operations using the backend actor.",
  "frontend/src/hooks/useRouteMeta.ts": "Defines meta descriptions and Open Graph titles for routes and applies them via a hook using router state.",
  "frontend/src/hooks/useScrollBehavior.ts": "Provides hooks for smooth scrolling to top or elements, respecting reduced-motion preferences and canceling animations cleanly.",
  "frontend/src/hooks/useScrollRestoration.ts": "Tracks and restores scroll positions on back/forward navigation by saving positions per route and handling popstate events.",
  "frontend/src/hooks/useSectionEntryMotion.ts": "Uses IntersectionObserver to detect when a section enters the viewport and trigger entry motion unless reduced motion is preferred.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme tokens, motion preferences, typography, and smooth scrolling behavior.",
  "frontend/src/layouts/RootLayout.tsx": "Root layout that sets document metadata, manages scroll behavior, renders global UI elements, and optionally shows a CTA back button.",
  "frontend/src/lib/demo/canonicalWatcherDemo.ts": "Legacy demo generator that now delegates to template-based demo generation based on detected template type.",
  "frontend/src/lib/demo/executionTemplates.ts": "Implements template-based demo generators producing feed items and structured results for research, ops, support, and watcher flows.",
  "frontend/src/lib/demo/promptTemplates.ts": "Defines reusable prompt template objects for various workflow categories and featured jobs, each with IDs, descriptions, prompts, and template types.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers before rendering the root component.",
  "frontend/src/motion/sectionEntryProfiles.ts": "Defines motion profile presets containing timing, easing, and intensity settings for reveal animations.",
  "frontend/src/motion/SectionEntryReveal.tsx": "Exports a wrapper component that applies motion profiles and visibility-based reveal animations to sections.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing Forge, its workflow model, and its use of the Internet Computer.",
  "frontend/src/pages/AgentSelfOnboardingPage.tsx": "Displays the autonomous agent onboarding specification with structured protocol details and ICP rationale.",
  "frontend/src/pages/BuildPage.tsx": "Implements the Build page highlighting why and how to build autonomous agents on Forge, with sections on features and getting started.",
  "frontend/src/pages/DemoLabPage.tsx": "Interactive page for running agent tasks, handling prompt input, template recommendations, and executing jobs with progress display.",
  "frontend/src/pages/DevelopersPage.tsx": "Static developers landing page with intro text and a DevelopersSection component.",
  "frontend/src/pages/DocsPage.tsx": "Documentation overview page describing core concepts and navigation to deeper docs.",
  "frontend/src/pages/ExplorePage.tsx": "Exploration interface allowing free‑form prompts, quick starts, and category-based navigation into the Demo Lab.",
  "frontend/src/pages/ForgeHomePage.tsx": "Marketing homepage presenting Forge’s value, capabilities, and navigation paths with animated sections.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with explanations of benefits and upcoming email authentication.",
  "frontend/src/pages/marketplace/CapabilityHiringSourcingAgentsPage.tsx": "Explains how agents hire and source other agents for sub‑tasks, outlining capabilities and example workflows. Includes navigation back to home and highlighted capability sections.",
  "frontend/src/pages/marketplace/CapabilityHumanInTheLoopControlsPage.tsx": "UI page describing human-in-the-loop controls with explanations, key capabilities, and example use cases.",
  "frontend/src/pages/marketplace/CapabilityLongRunningWorkflowsPage.tsx": "UI page outlining long‑running workflow capabilities, including persistent state, scheduling, and example applications.",
  "frontend/src/pages/marketplace/CapabilityMultiAgentCollaborationPage.tsx": "UI page presenting multi‑agent collaboration features, detailing delegation, orchestration, and use‑case examples.",
  "frontend/src/pages/marketplace/CapabilityTaskDrivenAgentsPage.tsx": "UI page explaining task‑driven autonomous agents, their abilities, and representative use cases.",
  "frontend/src/pages/MarketplacePage.tsx": "Renders the main marketplace overview with animated sections explaining discovery, deployment, and interaction with agents. Uses UI components and icons to present how the agent ecosystem works.",
  "frontend/src/pages/PlaybooksPage.tsx": "Displays documentation-style guidance for job request formats, including human-readable instructions and machine-parseable JSON specs. Includes sections for structured workflows and examples.",
  "frontend/src/pages/RoadmapPage.tsx": "Shows the product roadmap with a timeline component and a feedback section. Allows users to review long‑term plans and submit comments.",
  "frontend/src/pages/SupportPage.tsx": "Provides support information, contact details, and donation instructions with copy‑to‑clipboard functionality. Includes an explanation of ICP and ckBTC and a feedback component.",
  "frontend/src/pages/VisionPage.tsx": "Outlines the long‑term vision for autonomous agent workflows with detailed narrative sections. Describes future scenarios and multi‑step examples of agent‑orchestrated processes.",
  "frontend/src/utils/jobId.ts": "Generates unique job IDs and validates their format for execution flows.",
  "frontend/src/utils/rareVariants.ts": "Provides deterministic rare text variants based on jobId plus predefined variant sets for agent behavior signals.",
  "frontend/src/utils/time.ts": "Utility for formatting UTC timestamps in short or long formats.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session‑stored parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration enabling dark mode, plugin integrations, and extensive theme extensions for colors, spacing, animations, and UI effects.",
  "frontend/VERIFICATION-NOTES-PRODUCTION.md": "Template for recording production deployment verification including routing checks, SEO artifacts, scroll behavior, and authentication tests.",
  "project_state.json": "Project metadata describing current app state, features, and versions, outlining a marketplace-focused ICP app with authentication, backend canisters, and UI/UX systems."
}