{
  "backend/main.mo": "Motoko backend managing ratings, user profiles, aliases, and comments with access control and map-based storage.",
  "feature_evidence.json": "Feature evidence report mapping two rewrite tasks to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing functionality of key frontend components and pages.",
  "frontend/DEPLOYMENT-PRODUCTION.md": "Guide outlining prerequisites and steps for deploying the Forge AI frontend to mainnet.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "Base HTML template with root app mount point and SEO, Open Graph, and Twitter metadata.",
  "frontend/public/robots.txt": "Robots.txt allowing full crawler access and referencing the sitemap for indexing.",
  "frontend/public/sitemap.xml": "Defines sitemap entries listing main application routes, their change frequency, and priority for SEO.",
  "frontend/QA-PRELAUNCH-CHECKLIST.md": "Comprehensive QA checklist covering routing, responsiveness, accessibility, motion, CTAs, and SEO before launch.",
  "frontend/src/App.tsx": "Configures the app’s routing by mapping all pages and marketplace capability sub-pages to React Router routes.",
  "frontend/src/components/AboutVisionSection.tsx": "Renders a marketing section contrasting traditional AI with Forge’s autonomous capabilities using styled content blocks.",
  "frontend/src/components/ActivityFeed.tsx": "Displays a timed, animated activity feed with accessibility features and rare variant message substitutions.",
  "frontend/src/components/AgentCard.tsx": "Shows a UI card describing an agent’s identity, reputation, and acceptance of a task.",
  "frontend/src/components/AgentSelfOnboardingContract.tsx": "Presents the agent self-onboarding contract along with capability declaration schemas and example payloads.",
  "frontend/src/components/AiToHumanComingSoonSection.tsx": "Provides a marketing section explaining future human-in-the-loop capabilities for physical-world task completion.",
  "frontend/src/components/AuthStatus.tsx": "Handles authentication UI, including login/logout, showing user info, and triggering profile setup when needed.",
  "frontend/src/components/CommentsFeedback.tsx": "Provides a comments section that lets authenticated users post feedback, view comments, and upvote existing ones.",
  "frontend/src/components/CtaBackButton.tsx": "Renders a simple back button that navigates browser history backward.",
  "frontend/src/components/DevelopersSection.tsx": "Displays a promotional section for deploying AI agents and triggers an auth‑guarded deployment flow.",
  "frontend/src/components/ExecutionPanel.tsx": "Runs a multi‑phase execution flow with animated system messages, agent discovery, and result display for a job request.",
  "frontend/src/components/FooterNote.tsx": "Renders a multi‑column footer with navigation links and branding elements.",
  "frontend/src/components/ForgeBrandMark.tsx": "Shows the Forge AI brand text with adjustable sizes and styling.",
  "frontend/src/components/ForgeQuoteCard.tsx": "Displays an animated quote card highlighting Forge's vision with decorative quotation icons.",
  "frontend/src/components/FullScreenNavOverlay.tsx": "Full‑screen navigation overlay with focus trapping, ESC handling, and scroll lock, used for mobile menu navigation.",
  "frontend/src/components/GlobalHeader.tsx": "Sticky global header with scroll‑aware styling and a hamburger button that opens the full‑screen navigation overlay.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero block with branding, headline, input-driven CTA navigation, and conditional resume actions based on user identity.",
  "frontend/src/components/HomeSectionIndexFooter.tsx": "Sticky footer providing quick-jump buttons to homepage sections with smooth scrolling and keyboard support.",
  "frontend/src/components/JumpToFooter.tsx": "Floating button that scrolls smoothly (or instantly) to a referenced footer element.",
  "frontend/src/components/MagicalOnboardingSurvey.tsx": "Survey section offering selectable workflow templates that navigate users to demo-lab with preset prompts.",
  "frontend/src/components/MarketingSectionHeader.tsx": "Reusable marketing header component that renders a title, optional subtitles, micro‑statements, and custom children.",
  "frontend/src/components/MarketplaceDiscoverySection.tsx": "Marketplace discovery UI with mode toggle, free‑form workflow input, and preset template selectors that route to demo-lab.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for capturing a user’s name, saving the profile via mutation, and showing success or error toasts.",
  "frontend/src/components/ProgressiveDisclosure.tsx": "Expandable collapsible component with animated trigger and content.",
  "frontend/src/components/RatingStars.tsx": "Star rating widget that loads existing ratings, handles auth, and submits ratings for a job.",
  "frontend/src/components/ResultReveal.tsx": "Animated result display showing title, description, optional deliverable, metadata, and rating section.",
  "frontend/src/components/RoadmapTimeline.tsx": "Interactive multi-year roadmap timeline with selectable milestones and descriptions.",
  "frontend/src/components/RotatingPlaceholderInput.tsx": "Text input with rotating placeholder suggestions and submit-on-enter behavior.",
  "frontend/src/components/TrustComplianceStrip.tsx": "UI strip listing trust and compliance features with icons and descriptions.",
  "frontend/src/components/TrustedMetricsBar.tsx": "Performance metrics display pulling live platform stats and rendering them in cards.",
  "frontend/src/content/exploreDemoLabCopy.ts": "Centralized copy for Explore and Demo Lab flows including labels, headings, and CTAs.",
  "frontend/src/content/lexicon.ts": "Shared terminology definitions and preferred vocabulary for consistent agent-related language.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAgentFirstMode.ts": "Tracks a boolean agent-first UI mode in sessionStorage and provides a toggle.",
  "frontend/src/hooks/useAuthGuard.ts": "Provides an auth guard that triggers Internet Identity login when required.",
  "frontend/src/hooks/useComments.ts": "Handles fetching, adding, and upvoting comments using the backend actor with React Query.",
  "frontend/src/hooks/useCtaNavigation.ts": "Wraps navigation to mark transitions as CTA-driven for UI behavior.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the browser document title based on the current route.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity state, login/logout logic, and identity persistence via a React context.",
  "frontend/src/hooks/usePlatformPerformanceMetrics.ts": "Generates simulated platform metrics that update periodically without backend calls.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the user’s reduced‑motion preference.",
  "frontend/src/hooks/useQueries.ts": "Provides user profile, rating, and last‑task queries and mutations through the backend actor.",
  "frontend/src/hooks/useRouteMeta.ts": "Supplies route‑based meta descriptions and OG titles for SEO on navigation.",
  "frontend/src/hooks/useScrollBehavior.ts": "Enables smooth or instant scroll‑to‑top and section scrolling respecting reduced‑motion settings.",
  "frontend/src/hooks/useScrollRestoration.ts": "Tracks scroll positions per route and restores them on popstate navigation while disabling default browser behavior.",
  "frontend/src/hooks/useSectionEntryMotion.ts": "Uses IntersectionObserver to detect when a section enters view and trigger motion unless reduced-motion is preferred.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme tokens, motion settings, and typography plus reduced‑motion‑aware scrolling.",
  "frontend/src/layouts/RootLayout.tsx": "Root layout providing global header/footer, background layers, scroll behavior management, and CTA-based back button handling.",
  "frontend/src/lib/demo/canonicalWatcherDemo.ts": "Backwards‑compatible wrapper that generates demo output by delegating to template‑based demo generation.",
  "frontend/src/lib/demo/executionTemplates.ts": "Generates template‑driven demo data with feed steps and structured deliverables for research, ops, and other workflows.",
  "frontend/src/lib/demo/promptTemplates.ts": "Defines prompt templates mapping categories and featured jobs to specific execution template types.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind and conditional class names.",
  "frontend/src/main.tsx": "App entry point initializing React root, query client, identity provider, and global styles.",
  "frontend/src/motion/sectionEntryProfiles.ts": "Collection of motion profile configs defining timing, easing, and intensity for section‑entry animations.",
  "frontend/src/motion/SectionEntryReveal.tsx": "Component applying motion profiles and reveal animations using section entry detection.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page explaining Forge AI, its agent marketplace model, and why it runs on the Internet Computer. Contains multiple sections outlining outcomes-based workflows and on-chain autonomy.",
  "frontend/src/pages/AgentSelfOnboardingPage.tsx": "Displays the self-onboarding protocol for autonomous agents, including capability schemas, escrow rules, execution guarantees, and settlement semantics. Includes structured explanations and ICP rationale.",
  "frontend/src/pages/BuildPage.tsx": "Provides an overview of building autonomous agents on Forge with sections on benefits and getting started. Uses styled components and navigation to guide developers.",
  "frontend/src/pages/DemoLabPage.tsx": "Implements an interactive demo lab where users submit prompts, run jobs, and get agent execution previews. Manages template recommendations, job IDs, authentication, and execution state.",
  "frontend/src/pages/DevelopersPage.tsx": "Simple wrapper page that introduces developer-focused content and renders the DevelopersSection component.",
  "frontend/src/pages/DocsPage.tsx": "Renders documentation explaining core Forge concepts like autonomous execution, agent coordination, and on-chain settlement with styled informational sections.",
  "frontend/src/pages/ExplorePage.tsx": "Interactive explore page letting users enter free‑form prompts or choose templates, then navigating to the demo lab with the selected prompt.",
  "frontend/src/pages/ForgeHomePage.tsx": "Landing page showcasing Forge’s value, hero messaging, and navigation CTAs with animated section reveals.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with explanatory sections and an AuthStatus component.",
  "frontend/src/pages/marketplace/CapabilityHiringSourcingAgentsPage.tsx": "Explains how agents hire other agents, outlining capabilities, workflows, and examples within the marketplace. Includes navigation and styled informational sections.",
  "frontend/src/pages/marketplace/CapabilityHumanInTheLoopControlsPage.tsx": "Describes human-in-the-loop controls for agent workflows, detailing approval gates, guardrails, and example use cases. Provides structured sections with capabilities and navigation.",
  "frontend/src/pages/marketplace/CapabilityLongRunningWorkflowsPage.tsx": "Covers long‑running workflows where agents maintain state and operate over extended periods. Highlights capabilities like scheduling, persistence, and recovery with example use cases.",
  "frontend/src/pages/marketplace/CapabilityMultiAgentCollaborationPage.tsx": "React page describing multi‑agent collaboration with explanations, feature lists, and use‑case examples.",
  "frontend/src/pages/marketplace/CapabilityTaskDrivenAgentsPage.tsx": "React page outlining task‑driven agents, their autonomous workflow abilities, key capabilities, and example use cases.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace overview describing autonomous agent coordination with an example multi‑agent workflow and CTA navigation.",
  "frontend/src/pages/PlaybooksPage.tsx": "Playbooks page presenting human guidance and machine specs for job requests along with structured output examples.",
  "frontend/src/pages/RoadmapPage.tsx": "Roadmap page showing the product timeline and a feedback section with comments and contact info.",
  "frontend/src/pages/SupportPage.tsx": "Renders the Support page with contact info, donation address copy functionality, and explanations of ICP and ckBTC. Includes a CommentsFeedback component and interactive clipboard copying.",
  "frontend/src/pages/VisionPage.tsx": "Displays the overarching product vision and detailed examples of autonomous agent orchestration. Provides narrative sections describing workflows and future capabilities.",
  "frontend/src/utils/jobId.ts": "Generates unique jobIds using timestamp and random seed and validates their format.",
  "frontend/src/utils/rareVariants.ts": "Provides deterministic rare text variants based on jobId hashing, plus predefined agency variant sets.",
  "frontend/src/utils/time.ts": "Utility for formatting UTC timestamps in short and long formats.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters with sessionStorage fallback and hash support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, spacing, shadows, animations, and enabling plugins.",
  "frontend/VERIFICATION-NOTES-PRODUCTION.md": "Production deployment verification template for confirming routing, SEO artifacts, scroll behavior, and authentication.",
  "project_state.json": "Project metadata capturing app purpose, feature set, and versioned capability descriptions."
}