{
  "backend/main.mo": "Motoko canister implementing core backend logic for Forge, including access-controlled user profiles, ratings, comments, anonymous alias generation, and per-user state tracked with maps. It defines comparison helpers, authorization mixins, and CRUD-style methods for comments, votes, and job-related metadata.",
  "feature_evidence.json": "Structured feature evidence report mapping branding-related requirements to affected frontend files, components, and tests. Documents high-confidence changes to enforce text-only \"Forge AI\" branding and remove icon usage including favicon.",
  "frontend-file-summaries.txt": "Prewritten human-readable summaries of frontend source files describing design, UX intent, accessibility, motion preferences, routing, and branding decisions. Serves as documentation rather than executable code.",
  "frontend/index.css": "Global Tailwind CSS base defining Forge design tokens using OKLCH color variables, light/dark themes, border and background defaults, and accessibility-friendly motion and focus behavior.",
  "frontend/index.html": "Minimal HTML entry point that sets metadata, page title, root mount node, and loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes for all pages, wrapped in a ThemeProvider enforcing dark mode. Defines primary navigation paths including home, marketplace, demo lab, docs, and capability subpages.",
  "frontend/src/components/AboutVisionSection.tsx": "Homepage section contrasting traditional AI with Forge using outcome-driven messaging, scan-first layout, and progressive disclosure. Emphasizes execution, coordination, settlement, and persistence as Forge differentiators.",
  "frontend/src/components/ActivityFeed.tsx": "Animated activity feed component that reveals job execution steps over time, adds timestamps and rare message variants, announces updates via aria-live, and calls onComplete when finished.",
  "frontend/src/components/AgentCard.tsx": "Static presentational card showing a discovered agent (Watcher) with icon, capabilities, reputation, and acceptance status.",
  "frontend/src/components/AgentSelfOnboardingContract.tsx": "Long-form documentation UI rendering a machine-parseable self-onboarding contract for autonomous agents, including capability schemas, examples, and explanatory text.",
  "frontend/src/components/AuthStatus.tsx": "Authentication status widget that handles Internet Identity login/logout, displays the current user, clears query cache on logout, and triggers profile setup when needed.",
  "frontend/src/components/CommentsFeedback.tsx": "Feedback and comments component that lets authenticated users post comments, upvote existing ones, and view comments scoped to a page context with loading and error handling.",
  "frontend/src/components/DevelopersSection.tsx": "Marketing and onboarding section for developers that explains agent deployment on Forge, outlines value propositions, and gates deployment actions behind authentication.",
  "frontend/src/components/ExecutionPanel.tsx": "Manages the end-to-end execution flow UI for a user request, progressing through intro, analysis, agent selection, execution, and completion phases. It simulates system messages, accessibility announcements, and demo data generation with motion-aware timing.",
  "frontend/src/components/FooterNote.tsx": "Renders the site footer with a multi-column navigation layout linking to informational and product pages. Uses TanStack Router links and includes branding and visual accents.",
  "frontend/src/components/ForgeBrandMark.tsx": "Displays the text-based \"Forge AI\" brand mark with configurable sizes and gradient styling. Used across the app for consistent branding.",
  "frontend/src/components/ForgeQuoteCard.tsx": "Shows an animated quote card highlighting Forge’s vision with decorative icons and delayed fade-in animation. Intended as a visual, inspirational section on marketing pages.",
  "frontend/src/components/FullScreenNavOverlay.tsx": "Implements a full-screen navigation menu overlay with focus trapping, ESC handling, and scroll locking for accessibility. Provides large navigation links and programmatic routing.",
  "frontend/src/components/GlobalHeader.tsx": "Defines the fixed global header with brand logo and hamburger menu, including scroll-based styling changes. Controls the opening and closing of the full-screen navigation overlay.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero section with branding, value proposition, and primary CTAs. Handles prompt input, authentication-aware resume actions, and navigation to the demo lab or marketplace.",
  "frontend/src/components/HomeSectionIndexFooter.tsx": "Sticky footer navigation that provides buttons to jump to predefined homepage sections with smooth scrolling, respecting reduced motion preferences and keyboard accessibility.",
  "frontend/src/components/JumpToFooter.tsx": "Floating action button that scrolls the page to a referenced footer element, using smooth scrolling unless reduced motion is preferred.",
  "frontend/src/components/MagicalOnboardingSurvey.tsx": "Onboarding survey section that displays selectable workflow templates and navigates users to the demo lab with a chosen prompt.",
  "frontend/src/components/MarketplaceDiscoverySection.tsx": "Marketplace browsing section that lets users explore prompt templates by category or featured executions, toggle agent/human mode, and launch selected templates in the demo lab.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects and saves a user's name during initial setup, handling submission state and success/error feedback.",
  "frontend/src/components/ProgressiveDisclosure.tsx": "Reusable collapsible UI component that reveals or hides content with animated transitions and a titled trigger.",
  "frontend/src/components/RatingStars.tsx": "Interactive star rating component that loads an existing rating, enforces authentication, submits ratings, and provides submission feedback.",
  "frontend/src/components/ResultReveal.tsx": "Animated result display that reveals execution outcomes with metadata, completion status, and an embedded rating component, respecting reduced motion settings.",
  "frontend/src/components/RoadmapTimeline.tsx": "Renders an interactive 5-year product roadmap timeline with selectable milestones and animated styling. Uses local state to switch displayed year details based on user selection.",
  "frontend/src/components/RotatingPlaceholderInput.tsx": "Input component that cycles through example task placeholders on a timer, respecting reduced-motion preferences. Submits on Enter and exposes controlled value and optional ref.",
  "frontend/src/components/TrustComplianceStrip.tsx": "Displays a grid of trust and compliance features with icons and descriptions. Purely presentational, highlighting security, governance, and transparency principles.",
  "frontend/src/components/TrustedMetricsBar.tsx": "Shows a set of live-updating platform performance metrics in card form. Pulls simulated metrics from a custom hook and pairs them with fixed icons.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity using React Query. Reinitializes on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useAgentFirstMode.ts": "Manages a session-scoped boolean flag for \"agent-first mode\" with persistence in sessionStorage. Exposes the current mode and a toggle function.",
  "frontend/src/hooks/useAuthGuard.ts": "Provides a helper to require authentication before protected actions. Triggers Internet Identity login if no identity is present.",
  "frontend/src/hooks/useComments.ts": "Collection of hooks for fetching, adding, and upvoting comments via the backend actor. Integrates React Query caching and enforces authentication for mutations.",
  "frontend/src/hooks/useDocumentTitle.ts": "Sets the browser document title based on the current route pathname. Uses a static route-to-title mapping and reacts to router state changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a context provider and hook for Internet Identity authentication. Handles login, logout, identity persistence, and exposes detailed login status flags.",
  "frontend/src/hooks/usePlatformPerformanceMetrics.ts": "Generates deterministic, time-based platform metrics that update every 30 seconds without backend calls. Returns formatted agent, job, success rate, and response time data.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the user's prefers-reduced-motion media query. Returns a boolean indicating whether reduced motion is requested.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, ratings, and last forged task data via an Internet Computer actor, with cache invalidation and actor-availability guards.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers, global design tokens, and a dark-first Forge-themed color system with gradients, glow utilities, and base styles for the application.",
  "frontend/src/layouts/RootLayout.tsx": "Root layout component that applies global background effects, document title handling, and wraps routed content with a persistent header and footer.",
  "frontend/src/lib/demo/canonicalWatcherDemo.ts": "Legacy demo generator that preserves backward compatibility by delegating canonical watcher demos to the new template-based demo system.",
  "frontend/src/lib/demo/executionTemplates.ts": "Implements template-driven demo execution generators (watcher, research, ops, support) that produce mock activity feeds and structured results for the UI flow.",
  "frontend/src/lib/demo/promptTemplates.ts": "Defines reusable prompt templates for categories, featured jobs, and surveys, mapping user-facing prompts to specific execution template types.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that initializes React, global React Query client, Internet Identity provider, and mounts the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static informational page explaining Forge AI’s purpose, workflow-based execution model, and rationale for building on the Internet Computer.",
  "frontend/src/pages/BuildPage.tsx": "Marketing and onboarding page for building autonomous agents on Forge, highlighting benefits, features, and a getting-started flow with calls to action.",
  "frontend/src/pages/DemoLabPage.tsx": "Interactive demo lab that lets users submit prompts or templates to execute a sample agent task, manage execution state, and persist the last task for authenticated users.",
  "frontend/src/pages/DevelopersPage.tsx": "Simple wrapper page that renders a developer-focused landing section explaining how to build and monetize autonomous agents.",
  "frontend/src/pages/DocsPage.tsx": "Documentation-style page explaining Forge core concepts such as autonomous execution, multi-agent coordination, and on-chain workflows, with navigational CTAs.",
  "frontend/src/pages/ExplorePage.tsx": "Exploration page for browsing agents, with placeholder search/filter UI and a static list of featured agents.",
  "frontend/src/pages/ForgeHomePage.tsx": "Primary homepage with hero section, branding, smooth scrolling, and calls to explore agents or start building on the Forge marketplace.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login page that explains and promotes signing in via Internet Identity, with an AuthStatus component to handle authentication. Includes marketing copy describing benefits of signing in and an overview of Internet Identity.",
  "frontend/src/pages/marketplace/CapabilityHiringSourcingAgentsPage.tsx": "React page that presents the \"Hiring & Sourcing Agents\" capability, explaining how agents autonomously discover, evaluate, and hire other agents via the marketplace with examples and key features.",
  "frontend/src/pages/marketplace/CapabilityHumanInTheLoopControlsPage.tsx": "React page describing \"Human-in-the-Loop Controls,\" outlining approval gates, guardrails, and oversight mechanisms with example use cases and key capabilities.",
  "frontend/src/pages/marketplace/CapabilityLongRunningWorkflowsPage.tsx": "React page explaining \"Long-Running Workflows,\" focusing on agents that persist state and execute tasks over extended periods with scheduling and recovery features.",
  "frontend/src/pages/marketplace/CapabilityMultiAgentCollaborationPage.tsx": "React page showcasing \"Multi-Agent Collaboration,\" detailing how agents coordinate, delegate, and aggregate results across teams with parallel execution.",
  "frontend/src/pages/marketplace/CapabilityTaskDrivenAgentsPage.tsx": "React page introducing \"Task-Driven Agents,\" highlighting end-to-end autonomous workflows that adapt to context and deliver structured results.",
  "frontend/src/pages/MarketplacePage.tsx": "Displays a marketing page for the agent marketplace, outlining how users discover, deploy, compose, and monetize agents. Uses icons, descriptive sections, and navigation hooks to guide users toward marketplace actions.",
  "frontend/src/pages/PlaybooksPage.tsx": "Presents detailed playbooks that explain how to request jobs and define structured outputs for agents. Combines human-readable guidance with machine-readable JSON specifications and examples.",
  "frontend/src/pages/RoadmapPage.tsx": "Shows the product roadmap using a RoadmapTimeline component and invites community feedback. Includes a comments section and contact information to influence future priorities.",
  "frontend/src/pages/SupportPage.tsx": "Provides support and contact information, along with an option to donate using ICP or ckBTC. Includes copy-to-clipboard functionality for a donation address and a feedback/comments section.",
  "frontend/src/pages/VisionPage.tsx": "Articulates the long-term vision of an autonomous agent economy and Forge’s role as marketplace infrastructure. Uses narrative sections and visual components to explain agent collaboration, autonomy, and lifecycle concepts.",
  "frontend/src/utils/jobId.ts": "Utility functions to generate stable, unique job IDs for execution flows and to validate their format.",
  "frontend/src/utils/rareVariants.ts": "Utility for deterministically selecting low-frequency text variants based on a jobId seed, including predefined agency signal variants.",
  "frontend/src/utils/time.ts": "Shared utilities for formatting timestamps consistently in UTC, with short and long display formats.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query strings or hash-based routes, persist them to sessionStorage, and retrieve or clear them across navigation. Includes helpers to prioritize URL values, handle errors safely, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark-mode behavior, content paths, container settings, and an extended theme with Forge’s custom color system, radii, shadows, and animations. Registers typography, container queries, and animation plugins to support the design system.",
  "project_state.json": "Tracks the current project state, schema version, and a high-level vision for the Forge AI homepage redesign and information architecture. Enumerates implemented features with IDs, descriptions, versions, and requirement links to document progress and scope."
}