{
  "backend/main.mo": "Motoko canister managing ratings, user profiles, aliases, and comments with access control and helper comparison modules.",
  "feature_evidence.json": "JSON report mapping features to affected files, components, and test IDs for compliance tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of various frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing full light/dark color tokens and global styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the app root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app router configuring all page routes with RootLayout and theme provider.",
  "frontend/src/components/AboutVisionSection.tsx": "Marketing section contrasting traditional AI vs Forge with outcome‑focused feature lists and styled layout.",
  "frontend/src/components/ActivityFeed.tsx": "Displays feed items over time with optional motion reduction and rare message variants, announcing updates and calling onComplete when finished.",
  "frontend/src/components/AgentCard.tsx": "Shows a static card describing the Watcher agent with icon, reputation, and acceptance message.",
  "frontend/src/components/AgentSelfOnboardingContract.tsx": "Renders documentation cards describing the agent self‑onboarding contract and capability declaration schema with embedded JSON examples.",
  "frontend/src/components/AuthStatus.tsx": "Manages II authentication UI, login/logout actions, and triggers profile setup when needed.",
  "frontend/src/components/CommentsFeedback.tsx": "Provides a comments UI with posting, listing, and upvoting tied to page context and user identity.",
  "frontend/src/components/CtaBackButton.tsx": "A simple button that navigates browser history backward.",
  "frontend/src/components/DevelopersSection.tsx": "Displays a developer‑focused section describing agent deployment and gating actions behind authentication.",
  "frontend/src/components/ExecutionPanel.tsx": "Controls phased demo execution flow, managing system messages, agent discovery, and completion state transitions.",
  "frontend/src/components/FooterNote.tsx": "Renders multi-column footer with navigation links and branding icons.",
  "frontend/src/components/ForgeBrandMark.tsx": "Displays the Forge AI text logo with configurable sizing.",
  "frontend/src/components/ForgeQuoteCard.tsx": "Shows an animated quote card highlighting Forge’s vision with decorative icons.",
  "frontend/src/components/FullScreenNavOverlay.tsx": "Provides a full-screen navigation menu with focus trapping, ESC handling, and scroll locking.",
  "frontend/src/components/GlobalHeader.tsx": "Implements the main site header with scroll-based styling and a hamburger-triggered full-screen menu.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero with branding, description, and CTAs that navigate based on user input or last task.",
  "frontend/src/components/HomeSectionIndexFooter.tsx": "Offers a sticky footer of quick-jump buttons enabling smooth scrolling to key homepage sections.",
  "frontend/src/components/JumpToFooter.tsx": "Provides a floating button that scrolls smoothly to a referenced footer element, respecting reduced‑motion preferences.",
  "frontend/src/components/MagicalOnboardingSurvey.tsx": "Renders a selection of survey templates and navigates to the demo lab with a chosen prompt.",
  "frontend/src/components/MarketingSectionHeader.tsx": "Reusable marketing header component displaying a title, optional subtitle, micro‑statement, and children.",
  "frontend/src/components/MarketplaceDiscoverySection.tsx": "Displays marketplace categories and featured templates with mode toggling and navigation to demo workflows.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user for their name and saving the profile via mutation with success and error handling.",
  "frontend/src/components/ProgressiveDisclosure.tsx": "Expandable/collapsible section component with animated toggle and content reveal.",
  "frontend/src/components/RatingStars.tsx": "Star‑rating component that loads existing ratings, allows authenticated submissions, and shows submission status.",
  "frontend/src/components/ResultReveal.tsx": "Animated result display with metadata and a rating component, delaying reveal based on motion preferences.",
  "frontend/src/components/RoadmapTimeline.tsx": "Interactive timeline showing multi‑year roadmap milestones with selectable year details.",
  "frontend/src/components/RotatingPlaceholderInput.tsx": "Input component that cycles through preset placeholder texts unless reduced-motion is enabled and triggers submit on Enter.",
  "frontend/src/components/TrustComplianceStrip.tsx": "Renders a trust and compliance feature strip with icons and descriptive text about platform security intentions.",
  "frontend/src/components/TrustedMetricsBar.tsx": "Displays simulated live performance metrics using a custom hook and shows them in styled metric cards.",
  "frontend/src/content/lexicon.ts": "Defines shared terminology, preferred verbs, and microstatements for consistent agent-related vocabulary.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAgentFirstMode.ts": "Stores and toggles an agent-first UI mode using sessionStorage.",
  "frontend/src/hooks/useAuthGuard.ts": "Provides a helper to require authentication via Internet Identity before performing actions.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching, adding, and upvoting comments through the actor with auth enforcement and query invalidation.",
  "frontend/src/hooks/useCtaNavigation.ts": "Provides navigation helper that marks transitions as CTA-driven for UI back-button logic.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the document title based on the current route using a predefined route-to-title map.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePlatformPerformanceMetrics.ts": "Generates deterministic time-based simulated platform metrics that update every 30 seconds.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates reactively.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profile, ratings, and last forged task via an actor API.",
  "frontend/src/hooks/useScrollBehavior.ts": "Provides smooth scroll-to-top and element scrolling utilities respecting reduced-motion preferences.",
  "frontend/src/hooks/useScrollRestoration.ts": "Restores scroll positions on browser navigation using route keys and popstate detection.",
  "frontend/src/hooks/useSectionEntryMotion.ts": "IntersectionObserver-based hook that flags when a section enters view, with reduced-motion handling.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables, motion tokens, typography, and global scroll behavior rules.",
  "frontend/src/layouts/RootLayout.tsx": "App layout with global header/footer, background layers, scroll-to-top logic, and back-button handling.",
  "frontend/src/lib/demo/canonicalWatcherDemo.ts": "Legacy canonical watcher demo wrapper delegating to template-based demo generation.",
  "frontend/src/lib/demo/executionTemplates.ts": "Template-based demo generators producing feed items and result data for research, ops, support, and watcher flows.",
  "frontend/src/lib/demo/promptTemplates.ts": "Defines prompt template interfaces and collections for category, featured, and survey-based workflow prompts used in the demo.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page explaining Forge AI, its workflow model, and benefits of running on the Internet Computer.",
  "frontend/src/pages/BuildPage.tsx": "Displays a marketing page outlining why and how to build autonomous agents on Forge, with sections for features and onboarding.",
  "frontend/src/pages/DemoLabPage.tsx": "Implements the interactive demo lab allowing users to run prompts, select templates, and execute jobs with stateful UI handling.",
  "frontend/src/pages/DevelopersPage.tsx": "Shows a developer-focused landing page with introductory text and a DevelopersSection component.",
  "frontend/src/pages/DocsPage.tsx": "Provides a documentation overview page describing core concepts like autonomous execution and multi‑agent coordination.",
  "frontend/src/pages/ExplorePage.tsx": "Landing-style page showing search, filters, and placeholder featured agents with basic metadata.",
  "frontend/src/pages/ForgeHomePage.tsx": "Homepage with animated sections, branding, and CTAs guiding users to explore agents or start building.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with explanations of benefits and upcoming email auth.",
  "frontend/src/pages/marketplace/CapabilityHiringSourcingAgentsPage.tsx": "Explains how agents hire other agents, outlining capabilities, workflows, and examples of autonomous task delegation.",
  "frontend/src/pages/marketplace/CapabilityHumanInTheLoopControlsPage.tsx": "Describes human‑in‑the‑loop controls that let users set approval gates and guardrails for autonomous agents.",
  "frontend/src/pages/marketplace/CapabilityLongRunningWorkflowsPage.tsx": "Covers long‑running agent workflows, detailing persistent state, scheduling, and examples of extended autonomous tasks.",
  "frontend/src/pages/marketplace/CapabilityMultiAgentCollaborationPage.tsx": "React page describing multi-agent collaboration with explanations, key capabilities, and example use cases.",
  "frontend/src/pages/marketplace/CapabilityTaskDrivenAgentsPage.tsx": "React page outlining task‑driven agents with definitions, capabilities, and example workflows.",
  "frontend/src/pages/MarketplacePage.tsx": "Explains how the agent marketplace works through four core actions: discover, deploy, compose, and monetize.",
  "frontend/src/pages/PlaybooksPage.tsx": "Playbooks overview page describing human and machine job request formats with examples and structured specs.",
  "frontend/src/pages/RoadmapPage.tsx": "Roadmap timeline page with feedback section allowing users to comment or contact via email.",
  "frontend/src/pages/SupportPage.tsx": "Renders the support page with contact info, donation address copying, and explanations of ICP and ckBTC along with a feedback component.",
  "frontend/src/pages/VisionPage.tsx": "Displays the Vision page describing Forge’s AI economy narrative, autonomous agent workflows, and lifecycle concepts.",
  "frontend/src/utils/jobId.ts": "Provides functions to generate unique jobIds and validate their format.",
  "frontend/src/utils/rareVariants.ts": "Implements deterministic rare text variants based on jobId plus predefined agency variant sets.",
  "frontend/src/utils/time.ts": "Utility for formatting UTC timestamps in short and long forms.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, spacing, animations, and plugin usage.",
  "project_state.json": "Project state metadata describing current version, narrative direction, features, and requirements mapping."
}