{
  "kind": "build_request",
  "title": "Rewrite Vision page copy and Homepage hero block (leave rest of Homepage unchanged)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rewrite the Vision page copy in `frontend/src/pages/VisionPage.tsx` to match the provided “Vision” draft content and improve it for consistency and readability: use a clear, modern heading hierarchy (H1 page title, H2 major sections, H3 sub-steps in examples), maintain the same overall narrative and examples, keep the tone outcome-first, and reduce unnecessary crypto/blockchain jargon (e.g., prefer plain-language explanations over terms like “on-chain” unless essential).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-vision-paste",
          "msg-yes-confirm"
        ],
        "quotes": [
          "This the vision section: Vision ... (full Vision copy pasted)",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Vision page renders without layout regressions and remains fully readable/scannable with a consistent heading structure across sections and example steps.",
        "All user-facing text on `/vision` is updated to the rewritten version; no placeholder/lorem text remains.",
        "Rewrite keeps the same core sections and examples (Legal Action Orchestration, Supply Chain Verification, Market Research with Field Verification, AI as Infrastructure, Lifecycle, Why ICP is the Ideal Platform, Marketplace as Operating System) while improving clarity and reducing jargon.",
        "No changes are made to routing, authentication, backend, or non-copy UI behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rewrite only the Homepage hero block copy in `frontend/src/pages/ForgeHomePage.tsx` (headline, supporting paragraph, and the italic “Later…” line) using the provided hero text as the source-of-truth for meaning; do not modify any other Homepage sections, CTAs, or structure beyond the hero copy text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-hero-paste",
          "msg-yes-confirm"
        ],
        "quotes": [
          "Home page: Hero: Forge AI Humans Ask. AI Delivers. Request an outcome... Later: when physical constraints arise, agents may hire humans to complete real-world steps.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Only hero text content changes on the Homepage; all other Homepage sections remain byte-for-byte unchanged except for any necessary formatting to support the new hero copy.",
        "Homepage hero preserves the same intent: outcome-first positioning, agent orchestration, and the future human-hiring teaser line.",
        "No CTA destinations or button labels are changed unless required solely to match the rewritten hero copy (prefer keeping existing labels)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not change any other Homepage content outside the hero block in `frontend/src/pages/ForgeHomePage.tsx`.",
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Do not introduce new backend features; this request is copy-only."
  ],
  "nonGoals": [
    "Fixing known issues in comments upvoting, auth guard flow, or React Query anonymous-actor gating.",
    "Changing SEO route maps, sitemap, or robots.txt beyond what is strictly needed for the copy rewrite.",
    "Redesigning page layouts, navigation, or adding new sections to the Homepage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}