{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Copy-only updates for Vision page and Homepage hero block",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rewrite Vision page copy for clarity, consistent heading hierarchy, and reduced jargon while preserving sections and examples.",
      "acceptanceCriteria": [
        "Vision page renders without layout regressions and remains fully readable/scannable with a consistent heading structure across sections and example steps.",
        "All user-facing text on `/vision` is updated to the rewritten version; no placeholder/lorem text remains.",
        "Rewrite keeps the same core sections and examples (Legal Action Orchestration, Supply Chain Verification, Market Research with Field Verification, AI as Infrastructure, Lifecycle, Why ICP is the Ideal Platform, Marketplace as Operating System) while improving clarity and reducing jargon.",
        "No changes are made to routing, authentication, backend, or non-copy UI behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VisionPage.tsx",
          "operation": "modify",
          "description": "Update all user-facing copy to match the provided “Vision” draft content (source-of-truth for meaning), refining for consistency/readability: enforce a clear heading hierarchy (H1 page title, H2 major sections, H3 example sub-steps), keep the same narrative structure and examples, and reduce unnecessary crypto/blockchain jargon (prefer plain-language phrasing unless essential). Keep layout/classes/structure unchanged aside from text-level edits needed to support the heading hierarchy."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Rewrite only the Homepage hero block headline, supporting paragraph, and italic teaser line without changing any other Homepage content.",
      "acceptanceCriteria": [
        "Only hero text content changes on the Homepage; all other Homepage sections remain byte-for-byte unchanged except for any necessary formatting to support the new hero copy.",
        "Homepage hero preserves the same intent: outcome-first positioning, agent orchestration, and the future human-hiring teaser line.",
        "No CTA destinations or button labels are changed unless required solely to match the rewritten hero copy (prefer keeping existing labels)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ForgeHomePage.tsx",
          "operation": "modify",
          "description": "Rewrite ONLY the hero block copy (H1 headline text, supporting paragraph, and the italic “Later…” line) using the provided hero text as meaning source-of-truth. Do not change any other sections, CTAs, button labels, destinations, structure, ordering, or non-copy behavior on the Homepage; keep all non-hero content byte-for-byte unchanged."
        }
      ]
    }
  ]
}