{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Sitewide smooth scrolling + homepage micro-polish",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Enable sitewide smooth scrolling via global CSS while strictly honoring prefers-reduced-motion.",
      "acceptanceCriteria": [
        "On all pages, normal scrolling animates smoothly without requiring any per-component changes to scroll handlers.",
        "When the OS/browser setting prefers-reduced-motion is enabled, normal scrolling is not smoothed (reverts to default/instant behavior).",
        "No regression to existing animated sections and no new console errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a global CSS smooth-scroll rule (e.g., on the root scrolling element) gated under prefers-reduced-motion: no-preference so mousewheel/trackpad scrolling becomes smooth sitewide; ensure the existing prefers-reduced-motion: reduce block continues to force scroll-behavior: auto (non-smooth) without affecting non-scroll animations."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Refine scroll-to-top easing/duration and standardize section-jump scrolling with consistent reduced-motion behavior.",
      "acceptanceCriteria": [
        "Internal route navigations (handled in frontend/src/layouts/RootLayout.tsx) use the updated smoother scroll-to-top behavior.",
        "Homepage section jumps (e.g., ForgeHomePage scrollToSection + HomeSectionIndexFooter buttons) remain smooth when reduced-motion is off and are instant/non-animated when reduced-motion is on.",
        "Scroll-to-top animation cancels cleanly if another scroll-to-top is triggered mid-animation (no jitter)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useScrollBehavior.ts",
          "operation": "modify",
          "description": "Tune the scroll-to-top motion (duration and easing curve) for a smoother feel, and make the implementation more robust by ensuring re-entrant calls cancel cleanly and the returned function is stable (avoid unnecessary effect retriggers). Also introduce a shared helper for section-jump scrolling that mirrors the same prefers-reduced-motion behavior (smooth when allowed, instant otherwise)."
        },
        {
          "path": "frontend/src/layouts/RootLayout.tsx",
          "operation": "modify",
          "description": "Ensure route-change scroll-to-top continues to invoke the updated useSmoothScrollToTop behavior (and remains non-animated for reduced-motion users) without changing routing or scroll restoration logic."
        },
        {
          "path": "frontend/src/pages/ForgeHomePage.tsx",
          "operation": "modify",
          "description": "Replace the page-local scrollToSection implementation with the standardized section-jump behavior from the scroll behavior hook/util so section jumps match sitewide smoothness and prefers-reduced-motion handling consistently."
        },
        {
          "path": "frontend/src/components/HomeSectionIndexFooter.tsx",
          "operation": "modify",
          "description": "Update the sticky section index footer buttons to use the same standardized section-jump behavior used by the homepage (consistent smooth vs instant behavior based on prefers-reduced-motion)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply light-touch homepage visual polish (spacing, subtle gradients/glows, hierarchy) using existing Tailwind utilities without changing content structure or behavior.",
      "acceptanceCriteria": [
        "Hero section: improved spacing and typographic rhythm (headline/subheadline/CTAs) for faster scanability while keeping the same message and CTAs.",
        "Panels/cards (e.g., 'Agents vs. Traditional AI', capabilities, personas, ecosystem): slightly refined borders/glow/gradient treatments to feel cleaner and less harsh while preserving the Ghost Purple/black theme.",
        "Micro-interactions (hover/focus states) feel consistent and slightly more refined on the homepage (no new motion that violates prefers-reduced-motion behavior already defined in CSS).",
        "No changes to routing, data flow, or backend calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ForgeHomePage.tsx",
          "operation": "modify",
          "description": "Polish homepage presentation with small class-level adjustments only (no new sections/features): tighten hero spacing/rhythm, slightly soften background gradients and glow intensity on panels/cards, and normalize hover/focus treatments across hero CTAs and cards using existing Tailwind + existing Forge utility classes; ensure any motion remains covered by current prefers-reduced-motion CSS behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed to support the homepage polish without touching immutable UI component sources, adjust existing Forge utility classes/tokens (e.g., glow softness/gradient subtlety or transition timing tokens) in a minimal, backward-compatible way so the homepage refinements stay consistent with the site theme and reduced-motion rules."
        }
      ]
    }
  ]
}