{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Forge AI has evolved into a production-feeling, premium Ghost Purple + glassmorphism multipage marketplace experience (not demo-first). The app now emphasizes agentic economy narrative and conversion-first UX: reimagined homepage story arc with jump navigation, deeper Explore/Marketplace discovery with strengthened categories and richer sample jobs (including detailed simulated execution + polished outputs), sitewide motion/scan-speed/typography polish, and strict scroll-to-top on internal navigation with back/forward scroll restoration. The platform includes Internet Identity login, a public-readable/global feedback system filtered by page context with II-gated write + agree/upvote and stable non-human aliases, plus a Support & Donations page (ICP/ckBTC) and a unified structured footer with contact links. Demos/workflows live on dedicated subpages (Demo Lab), and a secondary “AI→human” future capability is teased across the site/roadmap as a high-level narrative about extending AI beyond the digital world via human fulfillment.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "ICP Motoko backend for marketplace user state",
      "synonyms": [
        "Backend canister",
        "Motoko actor",
        "ICP persistence"
      ],
      "description": "Implements an ICP canister that stores and serves user-gated state including user profiles, ratings keyed by (jobId, principal), and per-user last forged task continuity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Role-based access control with optional admin bootstrap",
      "synonyms": [
        "Access control",
        "RBAC",
        "Admin token bootstrap"
      ],
      "description": "Provides AccessControl (admin/user/guest) with initialization logic where the first caller can become admin if they present the correct secret token; includes admin checks and role assignment functions via a Motoko mixin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II integration",
        "AuthClient provider",
        "InternetIdentityProvider"
      ],
      "description": "Implements a React context for Internet Identity login/logout, identity persistence across reloads, login status state machine, and delegation validity handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Identity-aware ICP actor creation and query invalidation",
      "synonyms": [
        "useActor",
        "Actor hook",
        "Authenticated canister calls"
      ],
      "description": "Creates an anonymous or authenticated backend actor depending on Internet Identity state, initializes access control with a secret parameter, and invalidates/refetches dependent React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Auth status UI with first-login profile setup modal",
      "synonyms": [
        "AuthStatus",
        "ProfileSetupModal",
        "First-time user onboarding"
      ],
      "description": "Renders sign-in/sign-out controls, shows the user’s saved profile name when available, and triggers a modal to collect and persist a profile name for first-time authenticated users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Authentication guard for protected actions",
      "synonyms": [
        "useAuthGuard",
        "Require login"
      ],
      "description": "Provides a helper that triggers Internet Identity login on demand and returns whether the action can proceed, used to gate writes like ratings and comments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Demo Lab request workflow with prompt-driven navigation",
      "synonyms": [
        "Demo Lab page",
        "Request Work funnel"
      ],
      "description": "Implements a dedicated /demo-lab flow with free-form prompt submission, URL query prompt hydration, recommended template selection, progressive disclosure for browsing templates, and focus management when switching between request and execution views.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Multi-phase execution simulation orchestrator",
      "synonyms": [
        "ExecutionPanel",
        "Execution phases",
        "Analyzing → Agent Found → Executing → Completed"
      ],
      "description": "Runs a phased simulated execution (intro/analyzing/agent-found/executing/completed) with timed system messages, agent card reveal, activity feed, and result reveal; includes aria-live announcements for accessibility.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Live-feeling activity feed with rare agency variants",
      "synonyms": [
        "ActivityFeed",
        "Execution log",
        "Agency signal variants"
      ],
      "description": "Displays incremental feed items with UTC timestamps and reduced-motion-aware delays; injects deterministic low-frequency phrasing variants based on jobId to imply agent autonomy.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Template-driven demo generators with structured deliverables",
      "synonyms": [
        "executionTemplates",
        "Research/Ops/Support/Watcher templates"
      ],
      "description": "Generates detailed step feeds and polished multi-section deliverables for multiple execution paths (research, ops triage, support analysis, watcher alerts), selected via prompt keyword classification.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Result reveal with deliverable rendering and completion metadata",
      "synonyms": [
        "ResultReveal",
        "Deliverable panel"
      ],
      "description": "Reveals execution results with animated divider, optional formatted deliverable text, completion affirmation, and fixed payout metadata (simulated).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Execution rating system (load + submit) with Internet Identity gating",
      "synonyms": [
        "RatingStars",
        "Ratings persistence"
      ],
      "description": "Allows authenticated users to submit 1–5 star ratings for a jobId, loads existing ratings from the backend, invalidates cached rating queries on success, and displays a finality message after submission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Last forged task continuity and resume affordance",
      "synonyms": [
        "LastForgedTask",
        "Resume last execution"
      ],
      "description": "Stores the last requested task for authenticated users in the backend and surfaces a resume CTA on the hero to re-open the Demo Lab with the previous prompt.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Agent-first mode toggle (session persisted)",
      "synonyms": [
        "Agent mode",
        "Human/Agent toggle",
        "useAgentFirstMode"
      ],
      "description": "Adds a sessionStorage-backed toggle used in discovery surfaces to switch between human and agent framing and show agent-oriented ICP rationale content.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Explore page workflow discovery funnel",
      "synonyms": [
        "/explore",
        "Quick-start samples",
        "Browse by capability"
      ],
      "description": "Provides a primary free-form request path plus quick-start samples and optional category browsing (progressive disclosure), routing users into Demo Lab with prefilled prompts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Marketplace overview and capability sub-pages",
      "synonyms": [
        "/marketplace",
        "Capability detail pages"
      ],
      "description": "Implements a marketplace overview page and multiple capability detail pages (task-driven agents, multi-agent collaboration, hiring/sourcing, long-running workflows, human-in-the-loop controls) with CTAs to Demo Lab/Build/Docs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Agent self-onboarding protocol page with machine-parseable contract",
      "synonyms": [
        "/agent-onboarding",
        "AgentSelfOnboardingContract"
      ],
      "description": "Provides a dedicated onboarding surface for autonomous agents, including integration steps and embedded JSON schema blocks for capability declaration, escrow expectations, execution guarantees, and settlement semantics.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Playbooks page with human guidance + machine specifications",
      "synonyms": [
        "/playbooks",
        "Machine-readable specs"
      ],
      "description": "Publishes structured documentation combining human-readable operating guidance and JSON-like schemas for job requests, structured outputs, escrow/payment concepts, Internet Identity, and agent collaboration.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Interactive roadmap timeline with feedback section",
      "synonyms": [
        "/roadmap",
        "RoadmapTimeline",
        "Roadmap feedback"
      ],
      "description": "Implements a multi-year roadmap selector UI and embeds a feedback area that links to email support and displays a comments stream scoped to the roadmap page context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Page-context comments system (read public, write gated) with upvote toggling",
      "synonyms": [
        "CommentsFeedback",
        "Feedback forum",
        "Agree/upvote"
      ],
      "description": "Implements comment listing by page context (public read), authenticated comment creation, and authenticated upvote toggling backed by the ICP canister and React Query invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Author alias generation for comments",
      "synonyms": [
        "Pseudonymous alias",
        "getAlias",
        "Principal alias"
      ],
      "description": "Backend generates and persists a friendly alias per principal (prefix/suffix word lists) and uses it when creating comments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Global header with full-screen navigation overlay (accessible)",
      "synonyms": [
        "GlobalHeader",
        "FullScreenNavOverlay",
        "Hamburger menu"
      ],
      "description": "Provides a sticky header with a hamburger menu that opens a full-screen nav overlay with focus trapping, ESC-to-close behavior, body scroll locking, and keyboard-visible focus styles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Structured footer with contact links and agent onboarding CTA",
      "synonyms": [
        "FooterNote",
        "Contact us footer"
      ],
      "description": "Implements a multi-column footer with navigation links, email and X links, a feedback forum link, a Support link, and a prominent “Not human? Self-onboard as an agent” CTA.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Scroll management: smooth scroll-to-top, CTA back button, and back/forward restoration",
      "synonyms": [
        "useSmoothScrollToTop",
        "useScrollRestoration",
        "CtaBackButton"
      ],
      "description": "Disables browser auto scroll restoration, scrolls to top on non-popstate navigations, restores scroll position on back/forward, and shows a back button when the user arrived via CTA-marked navigation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Motion system with prefers-reduced-motion compliance",
      "synonyms": [
        "SectionEntryReveal",
        "useSectionEntryMotion",
        "Reduced motion support"
      ],
      "description": "Adds IntersectionObserver-driven section entry reveals with profile-based timing and CSS-variable tuning; disables or shortens animations and placeholder rotations when reduced motion is preferred.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "SEO foundations (robots/sitemap + per-route titles and meta tags)",
      "synonyms": [
        "SEO",
        "useDocumentTitle",
        "useRouteMeta",
        "robots.txt",
        "sitemap.xml"
      ],
      "description": "Provides static crawl artifacts (robots.txt, sitemap.xml) and runtime per-route document title and meta description/OpenGraph/Twitter tag updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Simulated platform performance metrics bar",
      "synonyms": [
        "TrustedMetricsBar",
        "usePlatformPerformanceMetrics"
      ],
      "description": "Displays time-based deterministic simulated marketplace metrics (active agents, jobs completed, success rate, response time) that update periodically without backend calls.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Support page with donation address and copy-to-clipboard",
      "synonyms": [
        "/support",
        "Donations",
        "Copy address"
      ],
      "description": "Implements a Support page with contact email, ICP/ckBTC explainer, a donation address displayed for both tokens, and a copy-to-clipboard button with visual feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Shared terminology lexicon for consistent copy",
      "synonyms": [
        "LEXICON",
        "Copy standards"
      ],
      "description": "Defines canonical terms, preferred verbs, and reusable micro-statements for consistent agent/orchestration/settlement vocabulary across the site.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-rewrite-the-vision-page-copy-to-make-the-humans-request-outcomes-ai-agents-execute-and-coordinate-optionally-hire-humans-for-real-world-steps-narrative-the-primary-vision-in-a-marketing-friendly-but-visionary-tone-integrated-directly-into-the-existing-vision-page-not-as-a-small-aside",
      "title": "Rewrite the Vision page copy to make the “humans request outcomes → AI agents execute and coordinate → optionally hire humans for real‑world steps” narrative the primary vision, in a marketing-friendly but visionary tone, integrated directly into the existing Vision page (not as a small aside).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-multi-step-storytelling-section-on-the-vision-page-that-uses-the-future-law-firm-scenario-as-a-concrete-example-of-ai-ai-human-orchestration-1-a-human-requests-legal-action-2-an-ai-orchestrates-multiple-ai-agents-to-research-and-generate-cross-reference-legal-precedents-and-draft-filings-3-the-ai-coordinates-the-final-real-world-step-by-hiring-a-human-to-serve-papers-and-4-the-workflow-completes-with-proof-results-returned-to-the-requester",
      "title": "Add a multi-step storytelling section on the Vision page that uses the future law-firm scenario as a concrete example of AI+AI+human orchestration: (1) a human requests legal action, (2) an AI orchestrates multiple AI agents to research and generate/cross-reference legal precedents and draft filings, (3) the AI coordinates the final real-world step by hiring a human to serve papers, and (4) the workflow completes with proof/results returned to the requester.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-updated-vision-copy-remains-consistent-with-existing-forge-terminology-used-across-the-site-e-g-execute-coordinate-orchestrate-settlement-and-does-not-introduce-conflicting-vocabulary-for-the-same-concepts",
      "title": "Ensure the updated Vision copy remains consistent with existing Forge terminology used across the site (e.g., “execute”, “coordinate”, “orchestrate”, “settlement”) and does not introduce conflicting vocabulary for the same concepts.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Rewrite the Vision page as the primary vision narrative in a marketing-friendly but visionary tone, using multi-step storytelling (e.g., future law-firm workflow: human requests legal action → AI orchestrates multiple AI agents for research/paperwork → hires a human for real-world service of papers) to illustrate AI+AI+human orchestration.",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "architectural_notes": [
    "Frontend uses TanStack Router for client-side routing with a RootLayout that centralizes global header/footer and navigation/scroll behaviors.",
    "Data fetching and mutations use TanStack React Query, with an identity-aware ICP actor created via a dedicated useActor hook.",
    "Internet Identity authentication is implemented as a React context provider (AuthClient) with login/logout and delegation validity checks.",
    "Backend is a single Motoko canister (actor) using mo:core Map-based in-memory storage for profiles, ratings, last-forged-task memory, and comments.",
    "Authorization is composed via a Motoko mixin (MixinAuthorization) and an access-control module that assigns roles and enforces permissions on methods.",
    "Demo execution UX is frontend-simulated and template-driven: prompt classification selects a template that generates an activity feed and a structured deliverable.",
    "UX emphasizes “live operation” via timed phase transitions, incremental feeds, and UTC timestamp utilities; all motion respects prefers-reduced-motion.",
    "SEO is implemented with static robots.txt/sitemap.xml plus runtime per-route document title and meta/OG/Twitter tag updates.",
    "Navigation includes CTA-marked transitions (route state) to conditionally show a Back button and support consistent scroll-to-top behavior.",
    "A reusable motion system combines IntersectionObserver-driven entry detection with profile-configured reveal timing via CSS variables."
  ],
  "known_issues": [
    "Comment upvoting is likely broken: backend upvoteComment expects a stored CommentId key, but getCommentsByPageContext returns comments without IDs; the frontend fabricates a deterministic ID from content+timestamp, which will not match backend sequential IDs.",
    "Backend state is not stored in stable variables; Maps and counters appear in-memory only, so data (profiles, ratings, comments, last tasks) may be lost on canister upgrade/reinstall.",
    "Authorization initialization traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, potentially breaking authenticated flows in misconfigured deployments.",
    "AccessControl.getUserRole traps for non-anonymous callers that were not initialized/registered, making correct initialization order critical.",
    "Frontend contains both frontend/src/index.css and frontend/index.css with different token sets; the non-src file may be dead/legacy and can confuse maintenance.",
    "Platform metrics and payment/settlement signals shown in the UI are simulated (e.g., $0.99 payout) and not tied to real on-chain escrow/settlement canisters yet.",
    "DevelopersSection describes REST-like endpoints (POST /api/...) as conceptual documentation; no corresponding HTTP API implementation is present in this codebase."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Forge AI",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}